; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_37)

(:domain logistics)

(:objects
	obj0 obj3 - airport
	obj1 obj4 - city
	obj2 obj6 obj8 obj9 obj10 obj13 obj14 obj15 - package
	obj5 obj7 - truck
	obj11 obj16 - airplane
	obj12 - location
)

(:init
	(at obj2 obj0)
	(at obj5 obj3)
	(at obj6 obj3)
	(at obj7 obj0)
	(at obj8 obj3)
	(at obj9 obj3)
	(at obj10 obj3)
	(at obj11 obj3)
	(at obj13 obj0)
	(at obj14 obj3)
	(at obj15 obj0)
	(at obj16 obj3)
	(in-city obj0 obj1)
	(in-city obj3 obj4)
	(in-city obj12 obj1)
)

(:goal (and
	(at obj2 obj3)
	(at obj6 obj12)
	(at obj8 obj12)
	(at obj9 obj12)
	(at obj10 obj12)
	(at obj13 obj3)
	(at obj14 obj12)
	(at obj15 obj3)
))
)

; plan
1. (load obj11 obj10 obj3)
   deleted: (at obj10 obj3)
   added: (in obj10 obj11)
   goals met: 0 of 8
2. (load obj11 obj14 obj3)
   deleted: (at obj14 obj3)
   added: (in obj14 obj11)
   goals met: 0 of 8
3. (load obj11 obj6 obj3)
   deleted: (at obj6 obj3)
   added: (in obj6 obj11)
   goals met: 0 of 8
4. (load obj11 obj8 obj3)
   deleted: (at obj8 obj3)
   added: (in obj8 obj11)
   goals met: 0 of 8
5. (load obj11 obj9 obj3)
   deleted: (at obj9 obj3)
   added: (in obj9 obj11)
   goals met: 0 of 8
6. (fly obj11 obj3 obj0)
   deleted: (at obj11 obj3)
   added: (at obj11 obj0)
   goals met: 0 of 8
7. (unload obj11 obj10 obj0)
   deleted: (in obj10 obj11)
   added: (at obj10 obj0)
   goals met: 0 of 8
8. (unload obj11 obj14 obj0)
   deleted: (in obj14 obj11)
   added: (at obj14 obj0)
   goals met: 0 of 8
9. (unload obj11 obj6 obj0)
   deleted: (in obj6 obj11)
   added: (at obj6 obj0)
   goals met: 0 of 8
10. (unload obj11 obj8 obj0)
   deleted: (in obj8 obj11)
   added: (at obj8 obj0)
   goals met: 0 of 8
11. (unload obj11 obj9 obj0)
   deleted: (in obj9 obj11)
   added: (at obj9 obj0)
   goals met: 0 of 8
12. (load obj7 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj7)
   goals met: 0 of 8
13. (load obj7 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj7)
   goals met: 0 of 8
14. (load obj7 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj7)
   goals met: 0 of 8
15. (load obj7 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj7)
   goals met: 0 of 8
16. (load obj7 obj9 obj0)
   deleted: (at obj9 obj0)
   added: (in obj9 obj7)
   goals met: 0 of 8
17. (drive obj7 obj0 obj12)
   deleted: (at obj7 obj0)
   added: (at obj7 obj12)
   goals met: 0 of 8
18. (fly obj16 obj3 obj0)
   deleted: (at obj16 obj3)
   added: (at obj16 obj0)
   goals met: 0 of 8
19. (load obj11 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj11)
   goals met: 0 of 8
20. (load obj11 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj11)
   goals met: 0 of 8
21. (load obj11 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj11)
   goals met: 0 of 8
22. (unload obj7 obj10 obj12)
   deleted: (in obj10 obj7)
   added: (at obj10 obj12)
   goals met: 1 of 8
23. (unload obj7 obj14 obj12)
   deleted: (in obj14 obj7)
   added: (at obj14 obj12)
   goals met: 2 of 8
24. (unload obj7 obj6 obj12)
   deleted: (in obj6 obj7)
   added: (at obj6 obj12)
   goals met: 3 of 8
25. (unload obj7 obj8 obj12)
   deleted: (in obj8 obj7)
   added: (at obj8 obj12)
   goals met: 4 of 8
26. (unload obj7 obj9 obj12)
   deleted: (in obj9 obj7)
   added: (at obj9 obj12)
   goals met: 5 of 8
27. (drive obj7 obj12 obj0)
   deleted: (at obj7 obj12)
   added: (at obj7 obj0)
   goals met: 5 of 8
28. (fly obj11 obj0 obj3)
   deleted: (at obj11 obj0)
   added: (at obj11 obj3)
   goals met: 5 of 8
29. (drive obj7 obj0 obj12)
   deleted: (at obj7 obj0)
   added: (at obj7 obj12)
   goals met: 5 of 8
30. (unload obj11 obj13 obj3)
   deleted: (in obj13 obj11)
   added: (at obj13 obj3)
   goals met: 6 of 8
31. (unload obj11 obj15 obj3)
   deleted: (in obj15 obj11)
   added: (at obj15 obj3)
   goals met: 7 of 8
32. (unload obj11 obj2 obj3)
   deleted: (in obj2 obj11)
   added: (at obj2 obj3)
   goals met: 8 of 8
